{"/All_Posts/1177":{"title":"1177 BC The Year Civilization Collapsed - Eric H Cline","data":{"":"Found this book around the house. It seemed interesting on the surface. Was a bit of a chore to read. The problem with ancient history is there is not much known about it. All that\ncan be done is read the old surviving written records and excavate some archeological sites. There is a significant amount of guesswork that goes into constructing theories and because of\nthat most conclusions that can be drawn are generalities that most likely happened within a somewhat precise time span, but nobody really knows for sure.Not really my cup of tea type of book, but it was somewhat well written, and there are some interesting tidbits talking about ancient egypt in it. The book focusese around \"The Sea Peoples\"\nwho were this group of migrating/attacking/refugee/nobodyknows invaders who came conquered some land, and then left. The book talks about events that eventually leads to the bronze\nage collapse, but looking back on this read 1 month later I can't really say I get too much out of this book.This book gets a photo rating of \"BarkChips\". You're looking at some scraps of what was once a tree but there is no way of knowing how tall the tree it belonged to was or\nany specifities about the actual tree because it has been grinded up into a bunch  of little pieces. This is much the nature of ancient history, except if you're lucky there will be remnents\nof the past, there is mostly not even that.Rating 3/10 Readability 4/10  Photo Score BarkChips/10"}},"/All_Posts/Alone":{"title":"How to Not Die Alone - Logan Ury","data":{"":"I should preface this by saying that I have read many different books in this self-improvement/dating genre. They all mostly say the same things, reference the same studies, and are structured in the same way. This book is no different\nthan the rest in most respects. The differences are that in this book she gives good advice on how to go about meeting new people, how to figure out if somebody is marriagable, and how to identify your greatest dating weaknesses.Its a very well written book. In fact one of the better written dating books that I have read. It is definately aimed more at women than men. It's not going to tell you that you have to stick to some strict gym regime but it will tell\nyou to buy clothes that fit you well, have realistic expectations in considering potential partners, and to be consciously deliberate in how you manage your dating life. I enjoyed it.I rate this book 10/10 in readabilitiy and qualitatively,  Red Flower/10"}},"/All_Posts/Bubble":{"title":"The Everything Bubble by  Graham Summers- A Beginner's guide to the Federal Reserve","data":{"":"This book was actually very interesting. Half of it details the history of the American financial system from the founding of the Federal Reserve in 1913 to the 2008 housing crisis. It talks about Nixon, Greenspan, Bernanke, and\nhow we are at the precipice of a huge recession and maybe even a depression. Was a good intro book into modern monitary theory. Not going to pretend like I understood everything in this book perfectly, but It gives some perspective\nto what exactly is money and why debt and interest rates are so important in the modern financial system. I would definately recommend this book.This book gets a photo rating of \"Long Grass\". It's almost ready to be cut and when the grass gets cut a whole bunch of government debt disappears and the Bull market restarts again.\nThe central bank is a complicated topic. I'm not the one to explain it. Read the book if you're interested. It's well written and explains everything in laymen's terms.Rating 8/10 Readability 10/10  Photo Score Long Grass/10"}},"/All_Posts/Cesar":{"title":"Cesar and Christ - Will Durant","data":{"":"This is a good book. But it's long. Really long. I'm only 400/600 pages after 2 weeks and the pages are big and tall. somewhat solid MAX reading. The book will conquer the casual reader. It is something you must commit to. There is a lot of interstesting Roman Republic - Roman Emperors societal/ narrative / cultural information in this book that is surprisingly similar to present day society. It's amazing what can be learned from the past. Definately worth a read if you are dedicated for the challenge.I probably have another week left on it at a least. But it's good, and it's well written and it teaches you alot about ancient way of life. It really makes you think at times. What I like about this book is it really gives you a feel for the times by giving an all encompassing account of society. It talks about art, warefare, economics, politics, societal structure, campaigns, election cycles, conquest, contextual information, describes major events and why they happened as they did, etc. Most pages are worth reading, Although it is alot to read. I never thought I would pick this book up but I don't really regret the time I have put into it.The last third of this book talks about the rise of christianty and the struggles of the Jews in the holy land during the later stages of the roman monarchy. It's interesting, but it seems like this is the place where Durant holds the most aback. It's hard to know exactly why the Roman empire was so captivated by christianty, considering how new of a religion it was at the time. I guess considering that many of the ancient roman stoics and greek logicians already believed in the concept of a higher power/ god it wasn't too hard to transition into a more structured, welcoming, formalizied, popular, relgion. The last part of the book definately leaves a bit to be desired It would have been nice if Durant talked a bit more about it.This book gets a photo rating of \"Pretty Stump\". It's a book that is oldish, and there are places where you can tell that the writing style is dated, but it is still for the most part relevent. You know that back in the day this book was a really big deal but it has since been chopped down and swallowed by the winds of time. It's too bad because it really does a good job of explaining history in a way that is actually digestable. You know that it was in fact a nice tree at one point but all that remains is a pretty stump. Unfortunate.I rate this book 10/10 in readabilitiy and qualitatively,  Red Flower/10"}},"/All_Posts/Confessions":{"title":"Confessions - Saint Augustine","data":{"":"This one was much harder to get through. I wanted to read a religious book for the experience of reading a religious book. The first half wasn't bad. Augustine talks\nabout his sinful affinities for wine, women, and petty theft. He also talks about how through this he still managed to move from Carthage to Rome and\nthen to Milan as a teacher of English/Writing. He talks about how his mother was deeply religious and how her death affected his\ndecision to finally join the catholic church and become a devout worshipper of the Lord. The second half reads like a bible in disguise. But, it does a good job of explaining western religious\nlines of reasoning. I feel like I learned a decent amount about why people choose to be religious and devote large amounts of their life to faith.Gotta go with \"Dying Flower\" for the photo rating. Augustine wrote this late in his life and it is clear by the end of it that he's writing it with preaching intentions.\nCan't really hate too much on this book, religious devotion is respectable.Rating 6/10 Readibility 3/10  photo Rating- DyingFlower/ 10"}},"/All_Posts/Descartes":{"title":"Rene Descartes- Discourses on Method and The Meditations","data":{"":"This book is not great. Barely Readable. 2 days of suffering. Renaissance tea sipping garbage. Boredom. Currently 2 weeks deep into Will Durant's Cesar and Christ\nand I can't think of a single interesting thing that is memorable from reading this book. Truly a waste of life and time. Forcing people to read this book could\nbe considered a form of cruel and unusual punishment.This book gets a photo rating of \"Light Switch\". I read this book and my brain was not turned on and I hadn't read enough philsophy books to understand every little detail that Descrates is saying.\nand I still haven't read enough to really understand this book. Maybe I will read Meditations again in the future.e Discourses on Method is a bit dated.Rating 2/10 Readability 2/10  Photo Score Light Switch/10"}},"/All_Posts/GoodNEvil":{"title":"Beyond Good and Evil Friedrich Nietzsche","data":{"":"The problem with this book is that it put me to sleep in many sections. The way that this guy writes is just plain predictable. Because of this I stumbled through this book with not much effort\nskipping parts of paragraphs at will. I can't even remember the core argument that he was trying to make except saying that modern society is getting too soft. After\nreading 3 random pages of the book to jog my memory I guess his main argument was that modern society needs to lean on traditionalist values in order to preserve order and functionality.\nAgain not a super attractive book for modern minds. And oncemore there are some things in this book that are not really acceptable in modern society.\nRead it and find out but probably don't because it's a hard one to get through.This book gets a photo rating of \"Undesirable Apple\". It's not bad, you can eat it, but just like the look of that apple in the photo you will also not be so sad if it stays on the tree, falls\ndown and decomposes. there are better apples out there.Rating 5/10 Readability 7/10  Photo Score Undesirable Apple/10"}},"/All_Posts/Graham":{"title":"The Intelligent-Investor Benjamin Graham","data":{"":"This book is legend status. Never have I read something that so eloquently teaches you to not be an Ape, think for yourself, don't be sheepish with your money, do your own reserach, and other timeless investing principles.\nI still have around 100 pages left in this book but it is beginning to wind down and I really must say it was an interesting one. It talks about how companies like to riddle their financial reports with fine print and it talks about\nhow to recognize price bubbles when they come. It talks alot about the tech bubble and all of the irationalities that got alot of people into alot of trouble.Just a good overall book on investing. Not going to teach you about indicators, or super specific stock analysis, but like it promises if you follow the teachings of the book the worst that will happen is that you will not make any money.\nYou will not lose huge amounts of money doing Graham's strategies. That's his whole deal is he teaches how to mitigate risk in a very risky place like the stock market. It's a good read.It can feel grindy/ boring at times, but it's worth reading in my opinion.This book gets a photo rating of \"Blue Sky\". It's a book that will make your investing future a blue sky of limitless posibilities if you take most of what is being said to heart.\nIt's not going to make you rich tomorrow but it will help you not make any catastrophic mistakes.Rating 8/10 Readability 10/10  Photo Score Blue Sky/10"}},"/All_Posts/January":{"title":"January Cluster Read --> Lao Tzu- Tao Te Ching, Marx and Engels- Communist Manifesto, Cicero- On Life and Death, Seneca- Letters from a Stoic, Epictetus- Discourses and selected Writings","data":{"":"Lao Tzu- Tao Te Ching\nDidn't get too much out of this book. Even with the long introduction talking about the concept of taoism,\nIt just didn't make much sense to me. It felt like stoicism + follow superiors + conform to society. The text\nitself is pretty short and chock full with contradictions. Not a total waste of time, but I don't think I'm\nthe type of person that can really get much out of taoism. But not going to judge it off of one book,\ntheres probably more to it but I'm not motivated to find out and read more taoist works.3/10... not my cup of tea\nMarx and Engels- Communist Manifesto\n\n\n\nPengiun Classics Communist Manifesto Amazon Buy Link\nThis one was quite interesting. The introduction was 180 pages and it talked about the European poltical cimate\nin the mid 1800s and why these marxist ideas were formed/ how they were formed and how/why they got popular.\nThe text itself isn't really my cup of tea. Sure if you've been delt a terrible hand in life and don't have much\nto make it great communism can be appealing but in general if you have a good path in your life it's hard to think that\nyou should believe in this type of thing. Now granted back then the standard of living was much worse for the majority of the\nworking populace, so it would make sense why this ideology was more powerful. But it's not like communism hadn't been tried many many\ncountries. Then end result is usually mass starvation/famine/death. It's a utopia that goes against all human nature.I can see how this book could normally be quite boring. But, with the 200 page introduction I now understand alot more about the physical text itself\nand the whole reading experience/context really helps enjoy this piece of history.Great theoretically, not as great in practice 7.1/10, C-\nCicero- On Life and Death\nThis book was good, but it was a bit hard to read. The back half of it was more intersting. I didn't get much out of the\nfirst part Tuscan Disputations. I would rank this a C grade Stoic text. There are better stoic works. This one fallows the format\nof a guided conversation to Atticus and Bfutus, which makes it feel more like a Plato's Republic style of work.\nNot my favorite type of writing style. Overall it explains most of the guiding principles of stoicism, but I wouldn't recommend it\nas a first stoic book. Cicero spends most of this book reflecting on his life in Roman Society while trying to advise younger\nreads how to live their lives.Mid Mid Mid Mid Mid Mid Mid Mid 4/10\nSeneca- Letters from a Stoic\nThis book I really didn't get much out of. People say that you must read alot of philsophy and then come back to this book to get any\nkind of understanding. I assure you I read every word and every sentence and every paragraph, but I cannot really tell you about any of the\nthoughts/ideas that they conveyed. Most of the letters were pretty short or uninteresting so I really didn't end up picking up much from this.\nI think it also doesn't help that letters in general are usually very dependant on contextual facts and interpersonal relations between people.\nThese are two things that I don't really know how to attain from a text written 2000+ years ago. Would not recommend this book unless you\nhave read alot on stoicism/ancient roman culture and now about everything that is going on in Rome at the time.This book was definately a fly-over for me. Maybe one day I'll read this again after I have read many more books from this era. 2/10\nEpictetus- Discourses and selected Writings\nThis book was great! probably the 2nd best stoic text I ever read behind meditations. Epictetus just knows how to write.\nOr maybe the translation is really good. I think after I read this book I felt alot better about the concept of death.\nFor a long time I was bothered by it but I think this book really helped me out alot. Some people like to say that stoicism\nis accepting the fact that as part of nature, you will have to take the ultimate L of dying, and it teaches you have to lose on your own terms.\nI'm not eplaining this very well. The hardest part to me about stoicism is recognizing what is in your control and what isn't.  The stoics never really\nexplain this very well. They seem to be better at explaining how to cope with the Losses. There are points in this book when you just stop reading and think about what\nEpictetus is saying because there are alot of quotable lines in this book. It's not all sunshines and rainbows, there are boring parts, but I strongly\nrecommend this book to anyone trying to understand stoicism. Like most philosophical books you really have to take your time reading it to understand what is\nbeing said but I think for this book it is actually worth doing.Exceptional, 2nd to only Meditations. 9/10"}},"/All_Posts/Maladies":{"title":"The Emperor of All Maladies A Biography of Cancer - Siddhartha Mukherjee","data":{"":"Read this book for work. The beginning was easy reading, but around halfway through the book just gets plain monotonous.\nAmbitious Cancer Scientist X discovers Y advancement onto cancer That Yields Z result that holistically yields small progressions in cancer treatment advancements.\nThe book is downright depressing. But I guess such is the nature of Cancer treatment. More people die from it or die with it in their system than beat it. Cells\nmutate with time and there is little that one can do to prevent it even if they stay away from known carcinogens.That said, the book is quite educational on the history of cancer. It explains how historically, some researchers were stopped from making advancements\nbecause of peanut butter-thick paradigms that could not be breached until new generations of trail-blazing young minds were able to \t prove superior methods and practices.\nThe greatest takeaway I got from this book is the fragility of life. One day you could be going about your status quo and the next you are finding out that you have 6 months to live\nbecause you had cancer that has metastisized to half of your body.This book gets a photo rating of \"Pretty Plant\". Throughout history cancer was not even talked about because most people didn't live long enough to die from it. Even still\nuntil modern times, there was no effective treatments or therapies for cancer. At least nowadays there are a few cancers that have positive prognoses. So in essence from reading this book\nit appears as though we are in the pretty plant stage of cancer research development. Soon it might even be flowering who knows.Rating 6/10 Readability 6/10  Photo Score"}},"/All_Posts/Meditations":{"title":"Meditations by Marcus Aurelius","data":{"":"Although this book is short, the beginning few pages were hard for me to get through. Once the book gets going Marcus Aurelius explains\nto the reader his viewpoints on life and life after death. Marcus explains that if there is any afterlife, life on earth would be very short\ncomparatively. He also seemed to think that you would be judged morally on your mortal actions on earth. Because of this the major point he talks about in this book is showing\nkindness and making your time on earth as productive and useful as possible. He claims that almost everyone has a consciousness  and a sense of morality and since everyone will die eventually\nyou need to maximize your positive impact on society. He also liked to stress that death is coming so you should live every day\nwith this assertive drive to do good for others, and society. You get a real feeling like Marcus in writing this book is coming to grips with the fact that death is part of the natural processes of\nlife. This book was short but In my opinion, it was worth reading, maybe even more than once. It was not very religious, it mostly just preached western greek and roman value systems.I was getting strong \"Tall-Tree\". Marcus was a very tall tree in Ancient Roman Society, but even trees have a finite lifespan and will die of natural causes eventually if not taken out\nby non-natural causes.Rating 7/10 Readability 7/10  Book Picture Score Tall-Tree/10"}},"/All_Posts/Prince":{"title":"The Prince - Machiavelli","data":{"":"Machiavelli was a man that was living during the dark ages of Italy. He had a somewhat failed political career and was a bit of a bitter man. Alot of the political failings of Italy and the church at that\ntime to stave off foreign invaders, and the reasons why the Princes of Italy had failed at the time made good sense to me. He made alot of good points in this book.Of course he also said alot of very unacceptable heinous practices about how to treat people that I will not go into detail about. You will have to read the book yourself if you are curious.\nOverall the book teaches you a bit about the history in Europe around the 1400-1500s and that was rather interesting to me.This book gets a photo rating of \"Old Dismembered sink plumbing\". The dude was dripping some facts, and no doubt at one time was functioning in society\nbut at the end of the day I think of old dismembered sink plumbing when i think of this book.Rating 5/10 Readability 5/10  Photo Score Old Dismembered Faucet/10"}},"/All_Posts/StoryOfPhilosophy":{"title":"The Story of Philosophy - Will Durant","data":{"":"This book was a decent read. In this book Will Durant attempts to connect a dozen different philosophers together through a\n\"Philosopher Family Tree\" of belief systems. He called it \"The Table of Philosophic Affiliations\". On the left side of the table you have\nthe stoics, on the right you have the epicureans, and in the middle you have the logicians. In this book Durant uses Nietszhe as his stoic\ndescendant, Kant as his logician descendant, and Voltaire as his epicurean discendant. These are the core people that he spends the most pages\ncovering. He fills the cracks with Lesser known philosophers like James, Russel, Bergson, Spencer, Corce, Bacon, Santayana, Spinoza, Dewey,\nSchopenhauer. People that were important in their day for slowly progressing philosophical concepts, but not really people that I remember reading\ntoo much about despite mindlessly covering some 300 pages of their boring lives.Usually something about how they were the brave on the face the church with mild criticisims that were viewed as total heresy back in the day, or some biography about how their early childhood traumas shaped\nthey nihilistic beliefs. It was interesting reading structurally because Durant always tells of the philosopher's life before he talks about their\nbeliefs as to provide life's context to their beliefs allowing the reader to more thoroughly understand the reasons behind their  beliefs.The chapter on Voltaire was the most interesting because he was more of a playwrite than a philosopher but, the dude seemed to have the ultimate\nskill of finessing the leaders into his favor even when he finds himself in trouble with the authorities. It was pretty common for philopsophers to\nget in trouble with a new ruler/ fall out of favor because their influence can be quite strong and their beliefs don't always allign with the ruling\nparty/ person of the land. But Voltaire could almost always finesse himself to victory.The Kant chapter was pretty incomprehensible. But then again I don't understand Hegel either. Nietzsche is the most easily understood german philosopher\nout of all of the german philopsophers of that era in my opinionThere is a lot in this book, and I'd say a good 30-40% of it went over my head or was not comprehended. It's not the easiest read but it's also not terrible either.Readability: 5/10Picture: SnowyTree/10"}},"/All_Posts":{"title":"All Posts","data":{"":""}},"/":{"title":"Max Book Bytes","data":{"":"Books read on the MAX\n\nBytes written at week's end\n\n\n\n\n\n\n\nRecent Posts\n\nThe Story of Philosophy by Will Durant\n\nA somewhat random concoction of biographies and studies of prominent philosophers from the last 2000 years.\n\nAmazon Buy Link\n\n\n\nFebruary 2023\n\nJanuary Cluster Read: Stoics, Communists, and Taoists\n\nRead alot of short books in January. Didn't want to itemize them because some of them left little impression on me.\n\nJanuary 2023\nHow To Not Die Alone by Logan Ury\n\nIt's a dating book.\n\nAmazon Buy Link\n\n\n\nDecember 2022\n\nCesar and Christ - Will Durant\n\nA 1000 year holistic history of ancient Rome from the Roman republic to the Fall of Rome.\n\nAmazon Buy Link\n\n\n\nDecember 2022"}},"/photos":{"title":"About","data":{"":"Research Software Engineer, Starcraft II Player, Swimmer, Avid Reader, Value Investing Studier.\nWhat are we here for? What will I regret when I am near death? How can I better myself?\nWhere is the meaning in all of this?These are the somewhat large questions my Non Fiction reading journey aims to accomplish.\n\nIn October 2022 I started working in Portland, Oregon full time as a research Software Engineer as my first software job out of college.\nI didn't want to get a place close to work yet or take care of a car.\nSo instead I commute in to work via MAX everyday. This leaves me with around 120 minutes of time to read everyday.In college I didn't really study too much liberal arts, or philosophy or religion or ideological constructs that would help answer these big questions. I had to study them on my own and reach my own conclusions.\nBut I was out of college now. This 4 year slog of just trying to pass the class, learn some stuff, program some stuff,  get a job, and get out of University was over.And what was ahead of me? 45+ years of full time work.A couple weeks before I had witnessed my grandfather's last breaths alive. He died at 93 of natural causes. I remember sitting in one of the front pews of the church at his funeral watching some orthodox\nclergymen go through their usual funeral service when when a wave of anxiety hit me. Although it might not seem like it in my youth, I am going to die one day.Echoes of the famous Metal Gear Solid 5 quote \"Why are we here, just to suffer?\" manifested the foundation of my journey of finding meaning from those who have existed before us.\nAfter all there is a wealth of knowledge that can be learned from written history, that most people tend to take for granted.Faced with this intangibley large unit of my life being subjugated by the 40 hour work week + a 10 hour commute week (at least for the time being) I realized I needed to find some meaning to the human condition of\nliving on a floating rock hurling through seemingly empty space so that I could direct my efforts with purpose and find meaning in the routine monotony of life that was ahead of me.So the purpose of this Site is to communicate my learnings / insights from my readings and also learn a little bit of web dev / take some photos / have an excuse to write.Non Ficiton Philosopophy, History, Life Advice, Religion and Finance books are my main genre interests. I still struggle with fiction because it is not real. I need the facts.\nI need a story that actually happened, or at least that millions of people believe happened."}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}}}