{"/":{"title":"Max Book Bytes","data":{"":"Books read on the MAX\n\nBytes written at week's end\n\n\n\n\n\n\n\nRecent Posts\n\nRecent reads -- year end 2023\n\nI have not stopped reading new books\n\n\n\n\n\nMid 2023 Reads\n\nMarch-July 2023\n\n\n\nFebruary 2023\n\nJanuary Cluster Read: Stoics, Communists, and Taoists\n\nRead alot of short books in January. Didn't want to itemize them because some of them left little impression on me.\n\nJanuary 2023\nHow To Not Die Alone by Logan Ury\n\nIt's a dating book.\n\nAmazon Buy Link\n\n\n\nDecember 2022\n\nCesar and Christ - Will Durant\n\nA 1000 year holistic history of ancient Rome from the Roman republic to the Fall of Rome.\n\nAmazon Buy Link\n\n\n\nDecember 2022"}},"/photos":{"title":"About","data":{"":"Research Software Engineer, Starcraft II Player, Swimmer, Avid Reader, Value Investing Studier.\nWhat are we here for? What will I regret when I am near death? How can I better myself?\nWhere is the meaning in all of this?These are the somewhat large questions my Non Fiction reading journey aims to accomplish.\n\nIn October 2022 I started working in Portland, Oregon full time as a research Software Engineer as my first software job out of college.\nI didn't want to get a place close to work yet or take care of a car.\nSo instead I commute in to work via MAX everyday. This leaves me with around 120 minutes of time to read everyday.In college I didn't really study too much liberal arts, or philosophy or religion or ideological constructs that would help answer these big questions. I had to study them on my own and reach my own conclusions.\nBut I was out of college now. This 4 year slog of just trying to pass the class, learn some stuff, program some stuff,  get a job, and get out of University was over.And what was ahead of me? 45+ years of full time work.A couple weeks before I had witnessed my grandfather's last breaths alive. He died at 93 of natural causes. I remember sitting in one of the front pews of the church at his funeral watching some orthodox\nclergymen go through their usual funeral service when when a wave of anxiety hit me. Although it might not seem like it in my youth, I am going to die one day.Echoes of the famous Metal Gear Solid 5 quote \"Why are we here, just to suffer?\" manifested the foundation of my journey of finding meaning from those who have existed before us.\nAfter all there is a wealth of knowledge that can be learned from written history, that most people tend to take for granted.Faced with this intangibley large unit of my life being subjugated by the 40 hour work week + a 10 hour commute week (at least for the time being) I realized I needed to find some meaning to the human condition of\nliving on a floating rock hurling through seemingly empty space so that I could direct my efforts with purpose and find meaning in the routine monotony of life that was ahead of me.So the purpose of this Site is to communicate my learnings / insights from my readings and also learn a little bit of web dev / take some photos / have an excuse to write.Non Ficiton Philosopophy, History, Life Advice, Religion and Finance books are my main genre interests. I still struggle with fiction because it is not real. I need the facts.\nI need a story that actually happened, or at least that millions of people believe happened."}},"/posts/1177":{"title":"1177 BC The Year Civilization Collapsed - Eric H Cline","data":{"":"Found this book around the house. It seemed interesting on the surface. Was a bit of a chore to read. The problem with ancient history is there is not much known about it. All that\ncan be done is read the old surviving written records and excavate some archeological sites. There is a significant amount of guesswork that goes into constructing theories and because of\nthat most conclusions that can be drawn are generalities that most likely happened within a somewhat precise time span, but nobody really knows for sure.Not really my cup of tea type of book, but it was somewhat well written, and there are some interesting tidbits talking about ancient egypt in it. The book focusese around \"The Sea Peoples\"\nwho were this group of migrating/attacking/refugee/nobodyknows invaders who came conquered some land, and then left. The book talks about events that eventually leads to the bronze\nage collapse, but looking back on this read 1 month later I can't really say I get too much out of this book.This book gets a photo rating of \"BarkChips\". You're looking at some scraps of what was once a tree but there is no way of knowing how tall the tree it belonged to was or\nany specifities about the actual tree because it has been grinded up into a bunch  of little pieces. This is much the nature of ancient history, except if you're lucky there will be remnents\nof the past, there is mostly not even that.Rating 3/10 Readability 4/10  Photo Score BarkChips/10"}},"/posts/Alone":{"title":"How to Not Die Alone - Logan Ury","data":{"":"I should preface this by saying that I have read many different books in this self-improvement/dating genre. They all mostly say the same things, reference the same studies, and are structured in the same way. This book is no different\nthan the rest in most respects. The differences are that in this book she gives good advice on how to go about meeting new people, how to figure out if somebody is marriagable, and how to identify your greatest dating weaknesses.Its a very well written book. In fact one of the better written dating books that I have read. It is definately aimed more at women than men. It's not going to tell you that you have to stick to some strict gym regime but it will tell\nyou to buy clothes that fit you well, have realistic expectations in considering potential partners, and to be consciously deliberate in how you manage your dating life. I enjoyed it.I rate this book 10/10 in readabilitiy and qualitatively,  Red Flower/10"}},"/posts/Cesar":{"title":"Cesar and Christ - Will Durant","data":{"":"This is a good book. But it's long. Really long. I'm only 400/600 pages after 2 weeks and the pages are big and tall. somewhat solid MAX reading. The book will conquer the casual reader. It is something you must commit to. There is a lot of interstesting Roman Republic - Roman Emperors societal/ narrative / cultural information in this book that is surprisingly similar to present day society. It's amazing what can be learned from the past. Definately worth a read if you are dedicated for the challenge.I probably have another week left on it at a least. But it's good, and it's well written and it teaches you alot about ancient way of life. It really makes you think at times. What I like about this book is it really gives you a feel for the times by giving an all encompassing account of society. It talks about art, warefare, economics, politics, societal structure, campaigns, election cycles, conquest, contextual information, describes major events and why they happened as they did, etc. Most pages are worth reading, Although it is alot to read. I never thought I would pick this book up but I don't really regret the time I have put into it.The last third of this book talks about the rise of christianty and the struggles of the Jews in the holy land during the later stages of the roman monarchy. It's interesting, but it seems like this is the place where Durant holds the most aback. It's hard to know exactly why the Roman empire was so captivated by christianty, considering how new of a religion it was at the time. I guess considering that many of the ancient roman stoics and greek logicians already believed in the concept of a higher power/ god it wasn't too hard to transition into a more structured, welcoming, formalizied, popular, relgion. The last part of the book definately leaves a bit to be desired It would have been nice if Durant talked a bit more about it.This book gets a photo rating of \"Pretty Stump\". It's a book that is oldish, and there are places where you can tell that the writing style is dated, but it is still for the most part relevent. You know that back in the day this book was a really big deal but it has since been chopped down and swallowed by the winds of time. It's too bad because it really does a good job of explaining history in a way that is actually digestable. You know that it was in fact a nice tree at one point but all that remains is a pretty stump. Unfortunate.I rate this book 10/10 in readabilitiy and qualitatively,  Red Flower/10"}},"/posts/Bubble":{"title":"The Everything Bubble by  Graham Summers- A Beginner's guide to the Federal Reserve","data":{"":"This book was actually very interesting. Half of it details the history of the American financial system from the founding of the Federal Reserve in 1913 to the 2008 housing crisis. It talks about Nixon, Greenspan, Bernanke, and\nhow we are at the precipice of a huge recession and maybe even a depression. Was a good intro book into modern monitary theory. Not going to pretend like I understood everything in this book perfectly, but It gives some perspective\nto what exactly is money and why debt and interest rates are so important in the modern financial system. I would definately recommend this book.This book gets a photo rating of \"Long Grass\". It's almost ready to be cut and when the grass gets cut a whole bunch of government debt disappears and the Bull market restarts again.\nThe central bank is a complicated topic. I'm not the one to explain it. Read the book if you're interested. It's well written and explains everything in laymen's terms.Rating 8/10 Readability 10/10  Photo Score Long Grass/10"}},"/posts/Confessions":{"title":"Confessions - Saint Augustine","data":{"":"This one was much harder to get through. I wanted to read a religious book for the experience of reading a religious book. The first half wasn't bad. Augustine talks\nabout his sinful affinities for wine, women, and petty theft. He also talks about how through this he still managed to move from Carthage to Rome and\nthen to Milan as a teacher of English/Writing. He talks about how his mother was deeply religious and how her death affected his\ndecision to finally join the catholic church and become a devout worshipper of the Lord. The second half reads like a bible in disguise. But, it does a good job of explaining western religious\nlines of reasoning. I feel like I learned a decent amount about why people choose to be religious and devote large amounts of their life to faith.Gotta go with \"Dying Flower\" for the photo rating. Augustine wrote this late in his life and it is clear by the end of it that he's writing it with preaching intentions.\nCan't really hate too much on this book, religious devotion is respectable.Rating 6/10 Readibility 3/10  photo Rating- DyingFlower/ 10"}},"/posts/Descartes":{"title":"Rene Descartes- Discourses on Method and The Meditations","data":{"":"This book is not great. Barely Readable. 2 days of suffering. Renaissance tea sipping garbage. Boredom. Currently 2 weeks deep into Will Durant's Cesar and Christ\nand I can't think of a single interesting thing that is memorable from reading this book. Truly a waste of life and time. Forcing people to read this book could\nbe considered a form of cruel and unusual punishment.This book gets a photo rating of \"Light Switch\". I read this book and my brain was not turned on and I hadn't read enough philsophy books to understand every little detail that Descrates is saying.\nand I still haven't read enough to really understand this book. Maybe I will read Meditations again in the future.e Discourses on Method is a bit dated.Rating 2/10 Readability 2/10  Photo Score Light Switch/10"}},"/posts/Graham":{"title":"The Intelligent-Investor Benjamin Graham","data":{"":"This book is legend status. Never have I read something that so eloquently teaches you to not be an Ape, think for yourself, don't be sheepish with your money, do your own reserach, and other timeless investing principles.\nI still have around 100 pages left in this book but it is beginning to wind down and I really must say it was an interesting one. It talks about how companies like to riddle their financial reports with fine print and it talks about\nhow to recognize price bubbles when they come. It talks alot about the tech bubble and all of the irationalities that got alot of people into alot of trouble.Just a good overall book on investing. Not going to teach you about indicators, or super specific stock analysis, but like it promises if you follow the teachings of the book the worst that will happen is that you will not make any money.\nYou will not lose huge amounts of money doing Graham's strategies. That's his whole deal is he teaches how to mitigate risk in a very risky place like the stock market. It's a good read.It can feel grindy/ boring at times, but it's worth reading in my opinion.This book gets a photo rating of \"Blue Sky\". It's a book that will make your investing future a blue sky of limitless posibilities if you take most of what is being said to heart.\nIt's not going to make you rich tomorrow but it will help you not make any catastrophic mistakes.Rating 8/10 Readability 10/10  Photo Score Blue Sky/10"}},"/posts/GoodNEvil":{"title":"Beyond Good and Evil Friedrich Nietzsche","data":{"":"The problem with this book is that it put me to sleep in many sections. The way that this guy writes is just plain predictable. Because of this I stumbled through this book with not much effort\nskipping parts of paragraphs at will. I can't even remember the core argument that he was trying to make except saying that modern society is getting too soft. After\nreading 3 random pages of the book to jog my memory I guess his main argument was that modern society needs to lean on traditionalist values in order to preserve order and functionality.\nAgain not a super attractive book for modern minds. And oncemore there are some things in this book that are not really acceptable in modern society.\nRead it and find out but probably don't because it's a hard one to get through.This book gets a photo rating of \"Undesirable Apple\". It's not bad, you can eat it, but just like the look of that apple in the photo you will also not be so sad if it stays on the tree, falls\ndown and decomposes. there are better apples out there.Rating 5/10 Readability 7/10  Photo Score Undesirable Apple/10"}},"/posts/Maladies":{"title":"The Emperor of All Maladies A Biography of Cancer - Siddhartha Mukherjee","data":{"":"Read this book for work. The beginning was easy reading, but around halfway through the book just gets plain monotonous.\nAmbitious Cancer Scientist X discovers Y advancement onto cancer That Yields Z result that holistically yields small progressions in cancer treatment advancements.\nThe book is downright depressing. But I guess such is the nature of Cancer treatment. More people die from it or die with it in their system than beat it. Cells\nmutate with time and there is little that one can do to prevent it even if they stay away from known carcinogens.That said, the book is quite educational on the history of cancer. It explains how historically, some researchers were stopped from making advancements\nbecause of peanut butter-thick paradigms that could not be breached until new generations of trail-blazing young minds were able to \t prove superior methods and practices.\nThe greatest takeaway I got from this book is the fragility of life. One day you could be going about your status quo and the next you are finding out that you have 6 months to live\nbecause you had cancer that has metastisized to half of your body.This book gets a photo rating of \"Pretty Plant\". Throughout history cancer was not even talked about because most people didn't live long enough to die from it. Even still\nuntil modern times, there was no effective treatments or therapies for cancer. At least nowadays there are a few cancers that have positive prognoses. So in essence from reading this book\nit appears as though we are in the pretty plant stage of cancer research development. Soon it might even be flowering who knows.Rating 6/10 Readability 6/10  Photo Score"}},"/posts/January":{"title":"January Cluster Read --> Lao Tzu- Tao Te Ching, Marx and Engels- Communist Manifesto, Cicero- On Life and Death, Seneca- Letters from a Stoic, Epictetus- Discourses and selected Writings","data":{"":"Lao Tzu- Tao Te Ching\nDidn't get too much out of this book. Even with the long introduction talking about the concept of taoism,\nIt just didn't make much sense to me. It felt like stoicism + follow superiors + conform to society. The text\nitself is pretty short and chock full with contradictions. Not a total waste of time, but I don't think I'm\nthe type of person that can really get much out of taoism. But not going to judge it off of one book,\ntheres probably more to it but I'm not motivated to find out and read more taoist works.3/10... not my cup of tea\nMarx and Engels- Communist Manifesto\n\n\n\nPengiun Classics Communist Manifesto Amazon Buy Link\nThis one was quite interesting. The introduction was 180 pages and it talked about the European poltical cimate\nin the mid 1800s and why these marxist ideas were formed/ how they were formed and how/why they got popular.\nThe text itself isn't really my cup of tea. Sure if you've been delt a terrible hand in life and don't have much\nto make it great communism can be appealing but in general if you have a good path in your life it's hard to think that\nyou should believe in this type of thing. Now granted back then the standard of living was much worse for the majority of the\nworking populace, so it would make sense why this ideology was more powerful. But it's not like communism hadn't been tried many many\ncountries. Then end result is usually mass starvation/famine/death. It's a utopia that goes against all human nature.I can see how this book could normally be quite boring. But, with the 200 page introduction I now understand alot more about the physical text itself\nand the whole reading experience/context really helps enjoy this piece of history.Great theoretically, not as great in practice 7.1/10, C-\nCicero- On Life and Death\nThis book was good, but it was a bit hard to read. The back half of it was more intersting. I didn't get much out of the\nfirst part Tuscan Disputations. I would rank this a C grade Stoic text. There are better stoic works. This one fallows the format\nof a guided conversation to Atticus and Bfutus, which makes it feel more like a Plato's Republic style of work.\nNot my favorite type of writing style. Overall it explains most of the guiding principles of stoicism, but I wouldn't recommend it\nas a first stoic book. Cicero spends most of this book reflecting on his life in Roman Society while trying to advise younger\nreads how to live their lives.Mid Mid Mid Mid Mid Mid Mid Mid 4/10\nSeneca- Letters from a Stoic\nThis book I really didn't get much out of. People say that you must read alot of philsophy and then come back to this book to get any\nkind of understanding. I assure you I read every word and every sentence and every paragraph, but I cannot really tell you about any of the\nthoughts/ideas that they conveyed. Most of the letters were pretty short or uninteresting so I really didn't end up picking up much from this.\nI think it also doesn't help that letters in general are usually very dependant on contextual facts and interpersonal relations between people.\nThese are two things that I don't really know how to attain from a text written 2000+ years ago. Would not recommend this book unless you\nhave read alot on stoicism/ancient roman culture and now about everything that is going on in Rome at the time.This book was definately a fly-over for me. Maybe one day I'll read this again after I have read many more books from this era. 2/10\nEpictetus- Discourses and selected Writings\nThis book was great! probably the 2nd best stoic text I ever read behind meditations. Epictetus just knows how to write.\nOr maybe the translation is really good. I think after I read this book I felt alot better about the concept of death.\nFor a long time I was bothered by it but I think this book really helped me out alot. Some people like to say that stoicism\nis accepting the fact that as part of nature, you will have to take the ultimate L of dying, and it teaches you have to lose on your own terms.\nI'm not eplaining this very well. The hardest part to me about stoicism is recognizing what is in your control and what isn't.  The stoics never really\nexplain this very well. They seem to be better at explaining how to cope with the Losses. There are points in this book when you just stop reading and think about what\nEpictetus is saying because there are alot of quotable lines in this book. It's not all sunshines and rainbows, there are boring parts, but I strongly\nrecommend this book to anyone trying to understand stoicism. Like most philosophical books you really have to take your time reading it to understand what is\nbeing said but I think for this book it is actually worth doing.Exceptional, 2nd to only Meditations. 9/10"}},"/posts/Meditations":{"title":"Meditations by Marcus Aurelius","data":{"":"Although this book is short, the beginning few pages were hard for me to get through. Once the book gets going Marcus Aurelius explains\nto the reader his viewpoints on life and life after death. Marcus explains that if there is any afterlife, life on earth would be very short\ncomparatively. He also seemed to think that you would be judged morally on your mortal actions on earth. Because of this the major point he talks about in this book is showing\nkindness and making your time on earth as productive and useful as possible. He claims that almost everyone has a consciousness  and a sense of morality and since everyone will die eventually\nyou need to maximize your positive impact on society. He also liked to stress that death is coming so you should live every day\nwith this assertive drive to do good for others, and society. You get a real feeling like Marcus in writing this book is coming to grips with the fact that death is part of the natural processes of\nlife. This book was short but In my opinion, it was worth reading, maybe even more than once. It was not very religious, it mostly just preached western greek and roman value systems.I was getting strong \"Tall-Tree\". Marcus was a very tall tree in Ancient Roman Society, but even trees have a finite lifespan and will die of natural causes eventually if not taken out\nby non-natural causes.Rating 7/10 Readability 7/10  Book Picture Score Tall-Tree/10"}},"/posts/Prince":{"title":"The Prince - Machiavelli","data":{"":"Machiavelli was a man that was living during the dark ages of Italy. He had a somewhat failed political career and was a bit of a bitter man. Alot of the political failings of Italy and the church at that\ntime to stave off foreign invaders, and the reasons why the Princes of Italy had failed at the time made good sense to me. He made alot of good points in this book.Of course he also said alot of very unacceptable heinous practices about how to treat people that I will not go into detail about. You will have to read the book yourself if you are curious.\nOverall the book teaches you a bit about the history in Europe around the 1400-1500s and that was rather interesting to me.This book gets a photo rating of \"Old Dismembered sink plumbing\". The dude was dripping some facts, and no doubt at one time was functioning in society\nbut at the end of the day I think of old dismembered sink plumbing when i think of this book.Rating 5/10 Readability 5/10  Photo Score Old Dismembered Faucet/10"}},"/posts/RecentReads":{"title":"The beginnings of my journey into fiction.","data":{"":"Much can be learned about the impact of an event in one's life from the acuity of the memory of it. Writing this summary many months later I reflect on my time reading the Age of Faith as a painful one.Will Durant's 1200 page saga \"The Age of Faith\" forced me to look at fiction in a light that I hadn't before\". Although incredibally well written and factual, reading the text itself was marginally more\nexciting than staring out the window of the MAX train car into the dark morning twighlight countryside. Although I learned alot about the middle ages, I didn't learn much new, or insightful information.just after reading age of faith I told myself I would right Durant's last work that went unpublished for many years before a relative digged it out of a dusty atic.Will Durant- Fallen Leaves. Last words on Life, Love, War, God.\nThis book didn't leave much of an impression on me. Will Durant was a classical acedemic. Skeptical of the existance of a god, and incredibly objective and talented at the craft. He had an ability\nto summarize and synthesize history that is unmatched, and I would argue many of his works have withstood the test of time. For now. But they are not entertaining.And thus ends the pain and suffering of reading Will Durant. Cesar and Christ was probably his most interesting work.In between Durant and The beginning of my 1800s Russian Literature Journey I read a somewaht boring textbook titled:\nIntroduction to Bioinformatics - Arthur M Lesk, because I thought it would give me more background on the biology of the data science part of my job that I do. Since I mostly do Software Engineering stuff I don't\nusually end up doing data science/ bioinformatics, but alot of the data that coworkers around me use and analyze is oftentimes \"bioinformatics\" type data. Sequence alignments, Drug Response, Metabolic Pathways, Transcriptomics, Regulatory networks.\nNot super interested in biology as a whole but I do find the complexity of data analysis required to make meaningful decisions/ synthesis very interesting. Cancer often seems like a great noble challenge that few dare\nto be buredened with and many have failed to find solutions to in the past. Oncology and Bioinformatics are not the same but they do have some overlap especially where I work. I don't think I'll be reading another bioinformatics textbook for awhile.The Fyodor Dostoevsky Saga (Devils, Crime and Punishment, The Idiot : June,July):I like this author. Dude had the poor 1800s Russian man life. Grow up dirt poor, work in siberia labor camp for 10 years. Then somehow find success as a proflific author in the later years of life.\nYou really get an appreciation for how you've got it when you read his books. Really really depressing, but humbling at the same time. He makes the most compelling arguments for monotheistic religion I have ever read.\nThis author single handedly changed my opinion on fiction and literature. Growing up, throughought elementary, middle and high school the books I was forced to read I had no interest in. Not a single strong, powerful male protagonist. ever.\nNobody I could relate to or strive to be like. Often childish or just straightup feminine themed books, or coming of age stories which were my personal least favorite.\nWith 1 exception. 1984 left an incredibly strong impression on me and I am very greatful that I was forced to read it at such a young age.Dostoevsky is not easy to read. Many of his characters go by 2-3 different names and he often has 10+ characters that play a significant part in the novel.Devils- This was the first Dostoevsky book I read and it was by far the most depressing/bloodiest. At the backhalf of the book there is practically death on every page. The author slowly details the destruction of a small town by the seems of its moral fabric with such accuracy and realism that\nyou are oftentimes left with a feeling of total gratitude and a desire to do good in the world and be a person of high moral stature as you are shown the affects of society when these standards are not upheld and evil lurks in every corner.\nThis book does not have a happy ending. It is not meant to be entertaining. It is a critique on nihilist russian society, and a good one at that.Crime and Punishment- There is a reason why this is his most popular work. It is structured into 5 digestible parts and it builds into a somewhat \"Russian\" style happy ending at the end, or about as much of a happy ending as you will ever\nget from this dude. It builds well and overall is a decent read but the middle of the book is a bit slow and unimpressionable. Most of the book is spent illustrating the mental breakdown of an incompetant killer who got really lucky and\ncannot deal with the mental consequences of his consciousness and knowing that he must be punished for his crimes. Mid.The Idiot- This one is harder to read than the others. The whole book revolves around the interactions created when one places an Idiot antihero playing a wealthy, autistic, morally jesus like figure into a Sodom and Gomorrah type Russian nihilist society. So basically you spend 500 pages reading about the idiot trying\nto win over a women for marriage, but he's a high value idiot so he doesn't realize he could wife up any of the women in the book if he wanted to. By the end of the book one thing is clear. The reader is the idiot for reading the whole thing. Yes,\nit is entertaining, but the middle of the book drags, and the end of the book is nothing short of a disappointment. Still, many of the themes present in Dostoevsky's other books are prominantly featured in this novel. And it's still 5x more interesting than Will Durant. Like I have said\nthis guy makes the strongest argument for religion I have ever read.I'm currently over halfway through Anna Karenina -Tolstoy. Tolstoy writes much more approachably and conventional than Dostoevsky. I'm not sure how to think about him. Although he writes well structured, well developed,\n\"classical\" literature with the same moralist themes and communist critiques that Dostoevsky also sports, it is much more subtley communicated. I like Dostoevsky's style better. Tolstoy was rich and it shows in his writing.\nYou don't get that same type of all access experience to the daily life of the peasant lifestyle like you do with Dostoevsky. Still good, entertaining, but I don't think I'm going to be reading War and Peace next.\nNot going to fully judge this book untill I've read it in its entiriety so let's leave it at that."}},"/posts/StoryOfPhilosophy":{"title":"The Story of Philosophy - Will Durant","data":{"":"This book was a decent read. In this book Will Durant attempts to connect a dozen different philosophers together through a\n\"Philosopher Family Tree\" of belief systems. He called it \"The Table of Philosophic Affiliations\". On the left side of the table you have\nthe stoics, on the right you have the epicureans, and in the middle you have the logicians. In this book Durant uses Nietszhe as his stoic\ndescendant, Kant as his logician descendant, and Voltaire as his epicurean discendant. These are the core people that he spends the most pages\ncovering. He fills the cracks with Lesser known philosophers like James, Russel, Bergson, Spencer, Corce, Bacon, Santayana, Spinoza, Dewey,\nSchopenhauer. People that were important in their day for slowly progressing philosophical concepts, but not really people that I remember reading\ntoo much about despite mindlessly covering some 300 pages of their boring lives.Usually something about how they were the brave on the face the church with mild criticisims that were viewed as total heresy back in the day, or some biography about how their early childhood traumas shaped\nthey nihilistic beliefs. It was interesting reading structurally because Durant always tells of the philosopher's life before he talks about their\nbeliefs as to provide life's context to their beliefs allowing the reader to more thoroughly understand the reasons behind their  beliefs.The chapter on Voltaire was the most interesting because he was more of a playwrite than a philosopher but, the dude seemed to have the ultimate\nskill of finessing the leaders into his favor even when he finds himself in trouble with the authorities. It was pretty common for philopsophers to\nget in trouble with a new ruler/ fall out of favor because their influence can be quite strong and their beliefs don't always allign with the ruling\nparty/ person of the land. But Voltaire could almost always finesse himself to victory.The Kant chapter was pretty incomprehensible. But then again I don't understand Hegel either. Nietzsche is the most easily understood german philosopher\nout of all of the german philopsophers of that era in my opinionThere is a lot in this book, and I'd say a good 30-40% of it went over my head or was not comprehended. It's not the easiest read but it's also not terrible either.Readability: 5/10Picture: SnowyTree/10"}},"/posts/Year_End_2023":{"title":"A checkpoint in finding meaning in reading","data":{"":"Anna Karenina - Tolstoy -- Full Review\nLooking back this book reminded me alot of Dostoevsky's Crime and Punishment. Very similar plot, the main difference is that Karenina did a public crime and\nRaskolnikov did a private crime. Whereas Dostoevsky explains the internal struggles of the antagonist as his consciousness absorbs his being, Tolstoy shows this similar\nprocess of grief and regret through how society/external characters / 3rd persion perspective. The effect is very different. Interesting read for sure. It's a bit of a slow\nburn, building in layers of plot. That's why I enjoyed this type of genre so much. It shows the merits of making morally good choices, and especially well, it shows the utterly destructive\neffects of treachery on its characters and society's response as a whole. At the time.Graded this C / Mid + but in reality it's probably more of a Decent / B / B- type of book.\nAltered Carbon - Richard Morgan\nAt this point had already had mostly postive experiences with non-fiction books so decided to dabble in some science fiction. Why not. This book was overall kindof\nmediocre. Was very dystopian and showed a world where income inequality, technological supremacy and nihilism dominate society. The plot revolves around solving some\nmurder mystery for an ultra rich virtually immortal 700 year old \"meth\" who is annoyed that someone evil is messing with him. But in reality there is no good and evil in this\nbook. Everybody is evil in the book. The protagonist is painted to look like the shining light / hero who does everybody's dirty work and emerges a great success in the end,\nbut in reality he's just some hired mercenary who over the course of the book decides to do what is righteous through a few hundred pages of character development.Mid -- C- / D+\nThe Holy Bible - New International Version\nTook about 3 months to read this. Not ever reading the old testament ever again. It was the same 5 stories told 10 different\nways. Sure the first 3 books are iconic, but once you get into David / kings stories it gets very very very repetitive. The new testament was much more interesting. The whole thing seemed like more of a history book than what most people would think of a \"Bible\". Sure there are many\nstories that much can be learned from, but most stories either revolve around the themes of \"crime and punishment\" or making righteous decisions and being rewarded with delayed gratification.There were definitely many parts that can / should be reread many times, but I'd say 80% of the bible could be separated into another book and the key points of the book would still be in tact.\nSure the bible has its criticisms. It is not a perfect book by any means. That said, there is a good reason why this book is earth's best seller for almost 2000 years in a row.\nDon't sleep on or disrespect religion. Everyone is mortal. From dust to dust. The universe is the closest thing to eternity one will ever witness.\nGod isn't a bad place to start. Although nobody is perfect, if everyone was a God fearing individual many of society's greatest problems would be significantly lessened.Not going to give a rating\nResistance to Evil by Force - Ivan Ilyin\nCouldn't really get through this one. It was supposed to be a critique of Tolstoy's regligous pacifism and a rationale for violence given a\ncertain key set of qualifiers, but I couldn't really get behind it. Was very boring and abstract. Like most philosophy books it never really\ngot into particular examples. What's the point of talking in abstracts if you can't apply it to realy life. I don't know maybe I'm just too\ndense for this type of reading.A solid D-/F\nIn Order to Live - Yeonmi Park\nThese types of female \"coming of age\" stories tend to be incredibly boring for me, but this one was actually decent. The editor was the real MVP of this book. Although\nYeonmi's story was captivating I'd say the most intersting part of this book was here ability to contrast the different cultural experiences between North Korea, China, South Korea, and America.\nEach place seems to be uniquely different in it's own right, with its own challenges and its own set of rules. Another thing I picked up from this book is the ability to be grateful for what you have.\nIf you're not starving, be grateful. If you have shelter, be grateful. If you are not a political  prisoner, be grateful. If you are in decent health, be grateful. If you have enough money to provide for\nyour basic needs, be grateful. Life can almost always be worse, until you're dead.Enjoyed this one -- A- / B+\nThink and Grow Rich - Napolean Hill\nVery provactive title indeed, but it strangely didn't disappoint too much. Title should be replaced with \"Think, Act. Act. Act. Keep working and then maybe someday when you are 40+ you might have some money\".\nBut that title wouldn't sell. But that's what it tells you to do. Still, it's not that bad of a book. Towards the end it gets a bit kooky. but this book tells many of stories about the key players of the\nindustrial revolution, Henry Ford, Andrew Carnegie, Thomas Eddison, the founding of Fedex, Southwest Airlines. Overall the book is intersting, quick read.A solid B\nDune - Frank Herbert\nCurrently on page 630/800 and it feels as though the book is just beginning to really heat up. Most of the book is spent\ngiving The main characteers \"tests\" and describing the destruction and evil of higher powers in the polticial chain of command.\nThis book describes modern politics to a certain extent in a rather frightening way. The character development of Paul and Jessica is well done, and\nthe handful of side characters are also sculpted well, something I hadn't seen in the Russian Literature that I had\nread previously. It also shows the virtues of western morals / values in a more modern approachable way through the contrast of the Harkonnen leadership,\nparticularly the evil Baron Vladimir Harkonnen vs. Paul and Jessica's approach to leadership of the fremen and Leto's approach to leadership of the Atreides.EDIT:Currently Finished Dune and Dune Messiah, the second book in the 6 book series. If a russian had written this series, the first and second book would\nhave been 1000+ page tragedy in which the protagonist slowly crumbles from atop their mountain of greatness, but, Herbert does the great service of leaving\nthe tragedy aspect of Paul to the second book. Personally, I enjoyed both books equally as much.For the first book it takes around 600 pages for the book to really get cooking and then the ending felt a bit rushed. It would've been nice to see some back and\nforth between Paul and the Baron of the Harkonnens but instead what you got was gigachad Paul Atreides swinging his big powerful fremen army around, summoning sand storms,\nand kicking butt. Which was enjoyable, but a bit unrealistic.This is easily top 3 books read this year A / A- territory\nDune Messiah - Frank Herbert\nThe second book was alot more intresting from a thematic perspective. In the first book Paul is made out to be a literal god and all of his actions align to this godly persona,\nin the second book the complete opposite is portrayed.  Although Paul has these godly powers of seeing the future he is still hosted in a very human, malleable body with human like\nemotions and human like tendancies. He struggles with holding up the empire with his royal wife and his actual wife, and battles with the hard choices that he sees ahead. In the first book,\nHerbert paints the primary antagonist, Vladimir Harkonnen to be some ruthless idiot, in the second book, Herbert paints the primary antagonist to be Paul himself.Oh boy the layers of plot that comes from this choice. The first half of the book was a bit annoying to read because you're thinking about all of the choices that could have been made to keep the empire together without having to lose what ended up getting lost.\nPaul could've had kids with the other wife, appeasing her, so that he could also have kids with his primary wife. He could've told most of the conspirator characters to get lost and take a hike. He could see the future.\nBut aparently he was also stunlocked into doing most of what the visions depict. He sees his own downfall ahead of time yet can't act against it. This seems like poor writing to me.\nBut then again, it reminded me of the plot lines of 19th century Russian literature, and this I enjoy reading. This is probably the weakest part of the whole book. Every human has free will.This is probably why most people reading the second book didn't like it. They didn't sign up for some proper depression reading. They wanted big explosion, victory, battle, conquest, adventure, and they got none of that.\nThey got an Emperror slowly melting into a puddle of nothing for 300 pages. But personally, I can enjoy some well crafted depression writing. Very nice.B+ / A- territory"}},"/posts":{"title":"All Posts","data":{"":""}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}}}